# 計算機環境の手引
## linux の起動方法・終了方法
- 電源投入（何もしなければ linux が起動） ⇒ パスワード入力
- アプリケーションランチャー（ALT+F1） ⇒ シャットダウン

## WIFI への接続方法
- 450号室以外の場合
  右下の WIFI アンテナマークをクリックし Kuins-Air を選択
  各自の ECS-ID、パスワードでログイン
- 450号室の場合
  海洋講座設置の WIFI ルーターに接続（接続情報は別掲）

## アプリの立ち上げ方法
CUI(Character User Interface)環境に慣れる。

- 使用するアプリ:
  - 端末アプリ(Konsole )
  - ファイル編集アプリ(emacs、 vi など別のアプリも可)
  - ウェブラウザ(Firefox)
- 各アプリの起動方法
  アプリケーションランチャーから
  - 端末:システム ⇒Konsole
  - 編集:ユーティリティ ⇒Emacs
  - ウェブ:インターネット ⇒Firefox

（各アプリを右クリックして「お気に入りに追加」を押すと、「アプリケーションランチャー」 ⇒「お気に入り」から選べる。）

## 端末でのコマンド（シェルコマンド）の使用方法
端末を立ち上げると
```
dd2025-{X}@DD >
```
などの文字が表示される。「dd2025-{X} 」(X は 1〜8 の数字)はユーザ名(利用者のアカウント名) 、「DD」が PC に割り振られた名前（ホスト名）。以下では「>」より左側を省略する。以下、よく使うシェルコマンドを説明する。

### ファイル・ディレクトリの一覧表示
（ディレクトリとは Windows の Folder のこと）

- 基本型
  ```
  > ls [ディレクトリ名]
  ```
  [] は省略可。省略すると現ディレクトリにあるファイル一覧が表示。
  - 例
    - 現ディレクトリのファイル一覧表示
      ```
      > ls
      bin ダウンロード テンプレート・
      ```

    - ”bin”ディレクトリのファイル一覧表示
      ```
      > ls bin
      ```

- 応用型
  ```
  > ls [オプション] [ディレクトリ名]
  ```

  - 例
    - 詳細情報(ファイルアクセスの最終時刻、ファイル容量、ファイル所有者、権限など)表示 
    ```
    > ls -l
    ```
  
    - 設定ファイル(隠しファイル)表示
    ```
    > ls -a 
    ```
    - 設定ファイルも含めて詳細情報を表示
    ```
    > ls -la
    ```

### ディレクトリの新規作成

- 基本型
  ```
  > mkdir ディレクトリ名
  ```

  - 例
    - test という名前のディレクトリを作成
    ```
    > mkdir test
    ```
    （すでに存在するディレクトリを作成しようとするとエラーとなる。）

### ディレクトリの移動

- 基本型
  ```
  > cd [移動先ディレクトリ名]
  ```
  - 例
    - test ディレクトリに移動
    ```
    > cd test
    ```
    - 一つ上のディレクトリに移動
      ```
      cd ..
      ```
    - ホームディレクトリに移動
      ```
      cd ~
      ```
      または
      ```
      cd
      ```
      （ディレクトリ名を省略するとホームディレクトリに移動）

### ファイルのコピー(複製)

- 基本型
  ```
  > cp 元ファイル名 新ファイル名
  ```

  - 例
    - A.txt というファイルを B.txt という名前でコピー
    ```
    cp A.txt B.txt
    ```
    - A.txt というファイルを test ディレクトリの下に B.txt という名前でコピー
    ```
    cp A.txt test/B.txt
    ```
    - A.txt というファイルを test ディレクトリの下に同じ名前でコピー
    ```
    cp A.txt test/[A.txt]
    ```
    （ファイル名が同じ場合は省略可）
    
### ファイル名の変更

- 基本型
  ```
  > mv 元ファイル名 新ファイル名
  ```
  - 例
    - A.txt というファイルを B.txt という名前に変更
    ```
    mv A.txt B.txt
    ```
    - A.txt というファイルを test ディレクトリの下の B.txt という名前に変更
    ```
    mv A.txt test/B.txt
    ```
    - A.txt というファイルを test ディレクトリの下の同じ名前のファイルに変更
    ```
    mv A.txt test/[A.txt]
    ```
    （ファイル名が同じ場合は省略可）

### ファイルの消去

- 基本型
  ```
  > rm ファイル名
  ```
  (確認されるので y を押す。)


### シェルコマンドの便利な機能

- ワイルドカード
  - 例
    - f90 で終わるファイル名のリスト
    ```
    > ls *.f90
    ```
    - e で始まり f90 で終わるファイル名のリスト

    ```
    > ls e*.f90
    ```
- TABキーの補完
  TAB キーを押すと補完される。例えば、上の練習では ls /ho まで入力して TAB キーを押すと /home/ まで補完してくれる。
  さらに /home/dd で TAB キーを押すと /home/dd2025- まで補完してくれる。

- 入力履歴
  CNTL-r を押す(コントロールキーを押しながら r キーを押す)と過去の入力履歴が検索できる。

### ファイル名について
ファイル名(ディレクトリ名)の指定方法は絶対パスと相対パスの2通り。
- 相対パス:今いるディレクトリからの相対的な位置関係。
  - 現在のディレクトリ：.
  - 1つ上のディレクトリ：..
  - ホームディレクトリ：~
- 絶対パス:ルートディレクトリ「/」から全部示す。
  - ホームディレクトリ：/home/dd2025-X/
  - ホームの下の test ディレクトリ：/home/dd2025-X/test/


## Emacs の使い方

- ファイルを開く: CNTL-x CNTL-f
- Emacs を終了する:CNTL-x CNTL-c
- ファイルを保存する:CNTL-x CNTL-s
- 1 頁下に進む:CNTL-V
- 1 頁上に進む:ESC-V
- 一行削除する:CNTL-k
- 切り取った行をペーストする:CNTL-y
- マークする:CNTL-space
- マークした箇所から現在のカーソル位置までを切り取る:CNTL-w
- マークした箇所から現在のカーソル位置までをコピーする:ESC-w
- 下向きに検索する:CNTL-s
- 上向きに検索する:CNTL-r
